Autodesk.Revit.DB.Analysis.SegmentOverrideType
The override types of analytical segment pressure drop calculation.
Since:
2024
Since:
2024

Autodesk.Revit.DB.Analysis.SegmentOverrideType.OverridePressureDrop
The segment pressure drop is overridden.

Autodesk.Revit.DB.Analysis.SegmentOverrideType.OverrideLossCoefficient
The segment loss coefficient is overridden.

Autodesk.Revit.DB.Analysis.SegmentOverrideType.None
The segment calculation is not overridden.